{
  "body": [
    {
      "type": "banner",
      "image": "banner.png",
      "links": [
        { "name": "youtube", "link": "https://youtu.be/zpOULjyy-n8" },
        { "name": "github", "link": "https://github.com/" }
      ],
      "youtube": "https://www.youtube.com/embed/zpOULjyy-n8?rel=0",
      "content": {
        "topheading": "EMAZON",
        "heading": "An ECommerce platform built to rival amazon",
        "subheading": ""
      }
    },
    { "type": "categories" },
    {
      "type": "title-and-text",
      "title": "Meet EMAZON",
      "youtube": "https://www.youtube.com/embed/zpOULjyy-n8?rel=0",
      "content": [
        "FlightLogger is a popular app for iOS and Android. With their real-time flight tracking technology, they offer worry-free traveling. FlightLogger takes the guesswork out of traveling by offering up to the minute details of flight delays and changes which facilitates the arrangement of airport pickups.",
        "Using FlightLogger, friends, and family can track flights of their loved ones. The app also has a handy feature that allows users to forward their flight information to the app and FlightLogger will automatically add it to the itinerary saving users a ton of time."
      ]
    },
    {
      "type": "text-left-image-right",
      "section-title": "Where FlightLogger Fits into the Marketplace",
      "title": "",
      "youtube": "https://www.youtube.com/embed/zpOULjyy-n8?rel=0",

      "content": [
        "As tech-driven people, we are always trying to manage every aspect of our daily lives through technology and avoid wasting time whenever possible. Since the team at Koombea travels frequently, as a result of having clients all over the world, we knew that an app like FlightLogger would do well in the app marketplace.",
        "Here at Koombea, we realized that FlightLogger would stand out and succeed with its advanced vision."
      ],
      "image": ""
    },

    {
      "type": "text-right-image-left",
      "section-title": "",
      "title": "FlightLogger Challenges that Koombea Solved",
      "image": "",
      "youtube": "https://www.youtube.com/embed/zpOULjyy-n8?rel=0",
      "content": [
        "One of the most challenging features of FlightLogger was to create an easy way to show flight itineraries in the form of a timeline. It might sound like an easy task, but we had to consider the different time zones and those cases when a flight departs on one day and arrives the next day. There were too many edge cases that were breaking the most common rules, so we had to be careful to avoid showing users incorrect data that could result in the user losing a flight or arriving late.",
        "We started solving the problem from the user’s perspective, searching for the best way to do this. We came up with a vision that allowed us to easily show all flights at a glance. This helped us design data for flights, flight duration and layover time. Then it became time to build the app! We tested several external APIs we could use to make our designs work the way it was designed, including all the data needed for the flights and airports.",
        "We started working on the logical algorithms to draw our FlightLogger timeline in a way its business logic could be reused on iOS, Android or Web. Our proprietary algorithms also had to consider account departure timezone, arrival time zone, flight durations, etc."
      ]
    },
    {
      "type": "list",
      "title": "",
      "subheading": "",
      "columns": "",
      "content": []
    },
    {
      "type": "text-left-image-right",
      "section-title": "",
      "title": "Where FlightLogger Fits into the Marketplace",
      "youtube": "https://www.youtube.com/embed/zpOULjyy-n8?rel=0",

      "content": [
        "As tech-driven people, we are always trying to manage every aspect of our daily lives through technology and avoid wasting time whenever possible. Since the team at Koombea travels frequently, as a result of having clients all over the world, we knew that an app like FlightLogger would do well in the app marketplace.",
        "Here at Koombea, we realized that FlightLogger would stand out and succeed with its advanced vision."
      ],
      "image": ""
    }
  ]
}
